<a href="https://colab.research.google.com/github/Davron030901/Pandas/blob/main/03_01_pandas_series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# import relevant libraries
import numpy as np
import pandas as pd

In [ ]:
# create a pandas series containing 8 random integers from -10 to 10 inclusive
pd.Series(np.random.randint(-10, 11, size=8))

0   -10
1    -6
2    -4
3     3
4     9
5    -7
6    -9
7     4
dtype: int64

In [ ]:
# create a pandas series containing 8 random integers from -10 to 10 inclusive
# with index being a through h
pd.Series(np.random.randint(-10, 11, size=8),
         index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

a   -5
b   -3
c   -8
d   -1
e   -3
f    9
g    5
h    2
dtype: int64

In [ ]:
# create a pandas series from a Python dictionary
pd.Series({'Mon': True, 'Tue': False, 'Wed': True, 'Thu': False,
          'Fri': True, 'Sat': False, 'Sun': True})

Mon     True
Tue    False
Wed     True
Thu    False
Fri     True
Sat    False
Sun     True
dtype: bool

In [ ]:
# create a pandas series from a scalar value
# to represent the maximum number of points students can earn
# in each of 10 exams for a particular course
pd.Series(150, index=np.arange(1, 11))

1     150
2     150
3     150
4     150
5     150
6     150
7     150
8     150
9     150
10    150
dtype: int64